Revit 2027 API
FabricationService.IsValidPaletteIndex Method
 Validates the palette index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidPaletteIndex(
	int paletteIndex
)
Public Function IsValidPaletteIndex (
	paletteIndex As Integer
) As Boolean
public:
bool IsValidPaletteIndex(
	int paletteIndex
)
member IsValidPaletteIndex :
        paletteIndex : int -> bool
Parameters
paletteIndex Int32
 The palette index to check.
Return Value
Boolean
 True if larger or equal to 0 and less than PaletteCount.
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace